app/views/ratings/index.html.erb

SELECT "ratings".* FROM "ratings"
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
---
          <th><%= link_to user.username, user %></th>
          <th><%= user.ratings.size%></th>