app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.includes(:ratings).all

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Tue, 21 Jan 2014 22:37:36 UTC +00:00], ["updated_at", Tue, 21 Jan 2014 22:37:36 UTC +00:00], ["username", "mluukkai"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["password_digest", "$2a$10$pbXOWRjF9uhqZdZOZ3iGb.d20Wp9R9CKEHZ/fpuqcDhmUKSIh9oKq"], ["updated_at", Thu, 23 Jan 2014 18:29:26 UTC +00:00]]
---
  def update
    respond_to do |format|
      if user_params[:username].nil? and @user == current_user and @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy
    if @user == current_user
      @user.destroy